#include <stdio.h>

// 数を表示するための関数
void show_font(char *number) {
  int row;      // 行
  int data;
  int column;   // 列
  int mask;

  for (row = 0; row < 5; row++) {
    // 一行目のデータを取り出す
    data = number[row];

    for (column = 0; column < 4; column++) {
      // 覆い隠すためのマスクを用意する
      mask = 0x08;
      // column ビット 左シフトする
      //  (mask = 0b1000 -> 0b0100 -> 0b0010 -> 0b0001 と変化していく)
      mask = mask >> column;
      // mask と ビット論理積(&)を取ると、
      // data の 3bit目が 0 か 1 かを 判定できる
      // printf("確認: %x & %x = %x\n", data, mask, data & mask);
      if ((data & mask) != 0){
        printf("■");
      } else {
        printf("□");
      }
    }
    printf("\n");
  }
}

int main(int argc, char const *argv[]) {

  // ビットマップフォントの定義
  // char型の配列を用意し、
  // 0-9まで、それぞれの数字の形になるよう、
  // 十六進数でビットを立てます。
  char bitmap[10][5] ={{0x0f,  // 0b1111 // 0
                        0x09,  // 0b1001
                        0x09,  // 0b1001
                        0x09,  // 0b1001
                        0x0f}, // 0b1111

                       {0x01,  // 0b0001  // 1
                        0x01,  // 0b0001
                        0x01,  // 0b0001
                        0x01,  // 0b0001
                        0x01}, // 0b0001

                       {0x0f,  // 0b1111  // 2
                        0x01,  // 0b0001
                        0x0f,  // 0b1111
                        0x08,  // 0b1000
                        0x0f}, // 0b1111

                       {0x0f,  // 0b1111  // 3
                        0x01,  // 0b0001
                        0x0f,  // 0b1111
                        0x01,  // 0b0001
                        0x0f}, // 0b1111

                       {0x09,  // 0b1001  // 4
                        0x09,  // 0b1001
                        0x0f,  // 0b1111
                        0x01,  // 0b0001
                        0x01}, // 0b0001

                       {0x0f,  // 0b1111  // 5
                        0x08,  // 0b1000
                        0x0f,  // 0b1111
                        0x01,  // 0b0001
                        0x0f}, // 0b1111

                       {0x0f,  // 0b1111  // 6
                        0x08,  // 0b1000
                        0x0f,  // 0b1111
                        0x09,  // 0b1001
                        0x0f}, // 0b1111

                       {0x0f,  // 0b1111  // 7
                        0x09,  // 0b1001
                        0x09,  // 0b1001
                        0x01,  // 0b0001
                        0x01}, // 0b0001

                       {0x0f,  // 0b1111  // 8
                        0x09,  // 0b1001
                        0x0f,  // 0b1111
                        0x09,  // 0b1001
                        0x0f}, // 0b1111

                       {0x0f,  // 0b1111  // 9
                        0x09,  // 0b1001
                        0x0f,  // 0b1111
                        0x01,  // 0b0001
                        0x0f}};// 0b1111

  // 定義した書体に従い、数を表示する
  for(int n = 0; n <= 9; n++) {
    // bit が立っているところを■、
    //       立っていないところを□として、表示させます。
    show_font(bitmap[n]);
    printf("\n");
  }

  return 0;
}
